Revit 2027 API
ParameterTypeId.ColorFillSwatchWidthParam Property
 "Swatch Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColorFillSwatchWidthParam { get; }
Public Shared ReadOnly Property ColorFillSwatchWidthParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColorFillSwatchWidthParam {
	ForgeTypeId^ get ();
}
static member ColorFillSwatchWidthParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace